app/api/music_store/v1/courses.rb

        def courses_params
          declared(params).slice(:course_name, :number, :no_of_subject, :percentage)
        end
      end

      resource :students do

        desc 'create courses for specififc students'
        route_param :id do
          resource :courses do
            params do
              requires :course_name, type: String
              requires :number, type: Float
              requires :no_of_subject, type: Integer
              requires :percentage, type: Float
              requires :student_id, type: Integer
            end
            post do
              student = Student.find(params[:id]).courses.create(courses_params)
---
INSERT INTO "courses" ("course_name", "number", "no_of_subject", "percentage", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

        route_param :id do
          resource :courses do
            get do
              student = Student.find(params[:id])
              if student.courses.present?
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."student_id" = ?  [["student_id", 2]]