app/api/music_store/v1/students.rb

SELECT "students".* FROM "students"
INSERT INTO "students" ("name", "city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Sandeep khede"], ["city", "Texas"], ["state", "Telangana"], ["created_at", "2023-06-28 20:11:47.969099"], ["updated_at", "2023-06-28 20:11:47.969099"]]
---
        def selected_attr(students)
          students.map do |student|
            {
              student_id: student.id,
              student_name: student.name
            }
          end
        end

      end

      resource :students do
        desc 'Return list of students'
        get do
          students = Student.all
          present selected_attr(students)
        end

        desc 'create a new student'
        params do
          requires :name, type: String
          requires :city, type: String
          requires :state, type: String
        end
        post do
          Student.create!(student_params)

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        desc 'Return a specific student'
        route_param :id do
          get do
            student = Student.find(params[:id])

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 4]]
---
        desc 'Delete a specific student'
        route_param :id do
          delete do
            student = Student.find(params[:id])
            if student.destroy!

UPDATE "students" SET "name" = ?, "city" = ?, "state" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "Narendra modi"], ["city", "Delhi"], ["state", "Delhi"], ["updated_at", "2023-06-28 19:08:19.876800"], ["id", 5]]
---
          end
          put do
            student = Student.find(params[:id])
            if student.update!(student_params)